# tuple переводит список в кортедж
# list переводит в список
# можно объединть кортеди при помощи + (под одну переменую)
# -------
# множество не имнют индекс и не упорядочены
# set создает его {}
# add добавляет элемент
# update добавляет немколько элементов
# remove удаляет элемент по ее названию
# discard удалет элемент по её нпзванию (без ошибки)
# pop удаляет с верху вниз
# также работает copy , clear
# union создаёт третье множество из 2 tuple3=tuple1.union(tuple2)
# -------
# словари
# thisdict = {
#     "brand": "Toyota",
#     "model": "Corolla",
#     "year": 2010,
# }
# обращение идет по ключам
# .get при сомнеии или незнании ключа
# если нету вернёт none
# dict ключевое слово для создания словаря
# если указать пустые скобки фигур {} это dict
# работет так же in
# .itens возвощает ключ и значение
# .keys возвращает только ключевые слова
# .pop удаляет пару (возврощяет значение)
# .popiten возвращяет ключ со значением (удаляет)
# .setdefault(s[0],"новое значение ")
# . vallues возвращае все значение
# 
#
#
#
#
#
#
#

